tutorials/fastFlume/constant/airfoilProperties/NACA6_0240
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// NACA 63-424, data generated by XFOIL. NCrit=2. 
// Viterna Extended w/ AR=8. Fourth column is the minimum pressure coefficient.
//   1          Number of airfoil tables in this file
//   8.0         Table ID parameter Reynolds number in millions.
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.9440  Zero Cn angle of attack (deg)
// 6.5796   Cn slope for zero lift (dimensionless)
// 3.2090   Cn extrapolated to value at positive stall angle of attack
// -0.6755  Cn at stall value for negative angle of attack
// 0.0000   Angle of attack for minimum CD (deg)
// 0.0059   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180	0.0000	0.0100)
	(-170	0.4065	0.0100)
	(-160	0.8130	0.0656)
	(-150	0.9585	0.2382)
	(-140	0.7836	0.4508)
	(-130	0.6393	0.6784)
	(-120	0.4904	0.8946)
	(-110	0.3293	1.0744)
	(-100	0.1615	1.1974)
	(-90    0.0000	1.2500)
	(-80   -0.1615	1.1974)
	(-70   -0.3293	1.0744)
	(-60   -0.4904	0.8946)
	(-50   -0.6393	0.6784)
	(-40   -0.7836	0.4508)
	(-30   -0.9585	0.2382)
	(-20   -0.8400	0.1070)
	(-10   -0.6835	0.0136)
	(-9	   -0.6551	0.0110)
	(-8	   -0.5990	0.0100)
	(-5	   -0.2785	0.0079)
	(-4	   -0.1605	0.0074)
	(-3	   -0.0396	0.0070)
	(-2	    0.0815	0.0064)
	(-1	    0.2046	0.0060)
	(0	    0.3288	0.0059)
	(1	    0.4505	0.0059)
	(2	    0.5696	0.0062)
	(3	    0.6869	0.0066)
	(4	    0.7958	0.0074)
	(6	    0.9864	0.0094)
	(7	    1.0636	0.0101)
	(8	    1.1217	0.0112)
	(9	    1.1532	0.0137)
	(11	    1.2140	0.0213)
	(12	    1.2522	0.0256)
	(13	    1.2922	0.0304)
	(15	    1.3624	0.0423)
	(16	    1.3922	0.0494)
	(17	    1.4225	0.0570)
	(18	    1.4431	0.0660)
	(19	    1.4663	0.0753)
	(20	    1.4819	0.0860)
	(22	    1.4994	0.1103)
	(25	    1.5113	0.1495)
	(26	    1.5098	0.1631)
	(30	    1.3693	0.2382)
	(40	    1.1195	0.4508)
	(50	    0.9133	0.6784)
	(60	    0.7006	0.8946)
	(70	    0.4705	1.0744)
	(80	    0.2307	1.1974)
	(90	    0.0000	1.2500)
	(100   -0.1615	1.1974)
	(110   -0.3293	1.0744)
	(120   -0.4904	0.8946)
	(130   -0.6393	0.6784)
	(140   -0.7836	0.4508)
	(150   -0.9585	0.2382)
	(160   -0.8130	0.0656)
	(170   -0.4065	0.0100)
	(180    0.0000	0.0100)
); 



