tutorials/fastFlume/constant/airfoilProperties/NACA6_0247
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 24.7 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.9418  Zero Cn angle of attack (deg)
// 6.5251   Cn slope for zero lift (dimensionless)
// 3.1821   Cn extrapolated to value at positive stall angle of attack
// -0.6704  Cn at stall value for negative angle of attack
// 0.0000   Angle of attack for minimum CD (deg)
// 0.0123   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.0164) 
	(-170.000    0.4028    0.0164) 
	(-160.000    0.8055    0.0714) 
	(-150.000    0.9497    0.2425) 
	(-140.000    0.7764    0.4531) 
	(-130.000    0.6334    0.6786) 
	(-120.000    0.4859    0.8928) 
	(-110.000    0.3263    1.0710) 
	(-100.000    0.1600    1.1928) 
	(-90.000     0.0000    1.2449)  
	(-80.000    -0.1600    1.1928) 
	(-70.000    -0.3263    1.0710) 
	(-60.000    -0.4859    0.8928) 
	(-50.000    -0.6334    0.6786) 
	(-40.000    -0.7764    0.4531) 
	(-30.000    -0.9497    0.2425) 
	(-20.000    -0.8323    0.1125) 
	(-10.000    -0.6772    0.0199) 
	(-9.000     -0.6491    0.0173)  
	(-8.000     -0.5935    0.0164)  
	(-5.000     -0.2759    0.0143)  
	(-4.000     -0.1590    0.0138)  
	(-3.000     -0.0392    0.0134)  
	(-2.000      0.0807    0.0128)   
	(-1.000      0.2027    0.0124)   
	(0.000       0.3258    0.0123)    
	(1.000       0.4464    0.0123)    
	(2.000       0.5644    0.0126)    
	(3.000       0.6806    0.0130)    
	(4.000       0.7885    0.0138)    
	(6.000       0.9773    0.0158)    
	(7.000       1.0538    0.0165)    
	(8.000       1.1114    0.0175)    
	(9.000       1.1426    0.0200)    
	(11.000      1.2028    0.0276)   
	(12.000      1.2407    0.0318)   
	(13.000      1.2803    0.0366)   
	(15.000      1.3499    0.0484)   
	(16.000      1.3794    0.0554)   
	(17.000      1.4094    0.0629)   
	(18.000      1.4298    0.0718)   
	(19.000      1.4528    0.0811)   
	(20.000      1.4683    0.0917)   
	(22.000      1.4856    0.1157)   
	(25.000      1.4974    0.1546)   
	(26.000      1.4959    0.1680)   
	(30.000      1.3567    0.2425)   
	(40.000      1.1092    0.4531)   
	(50.000      0.9049    0.6786)   
	(60.000      0.6941    0.8928)   
	(70.000      0.4662    1.0710)   
	(80.000      0.2286    1.1928)   
	(90.000      0.0000    1.2449)   
	(100.000    -0.1600    1.1928) 
	(110.000    -0.3263    1.0710) 
	(120.000    -0.4859    0.8928) 
	(130.000    -0.6334    0.6786) 
	(140.000    -0.7764    0.4531) 
	(150.000    -0.9497    0.2425) 
	(160.000    -0.8055    0.0714) 
	(170.000    -0.4028    0.0164) 
	(180.000     0.0000    0.0164)  
); 



