tutorials/fastFlume/constant/airfoilProperties/NACA6_0276
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 27.6 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.9291  Zero Cn angle of attack (deg)
// 6.3006   Cn slope for zero lift (dimensionless)
// 3.0713   Cn extrapolated to value at positive stall angle of attack
// -0.6492  Cn at stall value for negative angle of attack
// 0.0000   Angle of attack for minimum CD (deg)
// 0.0388   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.0427) 
	(-170.000    0.3872    0.0427) 
	(-160.000    0.7745    0.0957) 
	(-150.000    0.9131    0.2601) 
	(-140.000    0.7465    0.4626) 
	(-130.000    0.6090    0.6794) 
	(-120.000    0.4672    0.8854) 
	(-110.000    0.3137    1.0567) 
	(-100.000    0.1539    1.1738) 
	(-90.000     0.0000    1.2239)  
	(-80.000    -0.1539    1.1738) 
	(-70.000    -0.3137    1.0567) 
	(-60.000    -0.4672    0.8854) 
	(-50.000    -0.6090    0.6794) 
	(-40.000    -0.7465    0.4626) 
	(-30.000    -0.9131    0.2601) 
	(-20.000    -0.8002    0.1351) 
	(-10.000    -0.6511    0.0461) 
	(-9.000     -0.6241    0.0436)  
	(-8.000     -0.5706    0.0427)  
	(-5.000     -0.2653    0.0407)  
	(-4.000     -0.1529    0.0402)  
	(-3.000     -0.0377    0.0398)  
	(-2.000      0.0776    0.0393)   
	(-1.000      0.1949    0.0389)   
	(0.000       0.3132    0.0388)    
	(1.000       0.4292    0.0388)    
	(2.000       0.5426    0.0391)    
	(3.000       0.6544    0.0394)    
	(4.000       0.7581    0.0402)    
	(6.000       0.9397    0.0421)    
	(7.000       1.0132    0.0428)    
	(8.000       1.0686    0.0438)    
	(9.000       1.0986    0.0462)    
	(11.000      1.1565    0.0534)   
	(12.000      1.1929    0.0575)   
	(13.000      1.2310    0.0621)   
	(15.000      1.2979    0.0735)   
	(16.000      1.3263    0.0802)   
	(17.000      1.3551    0.0875)   
	(18.000      1.3747    0.0960)   
	(19.000      1.3968    0.1049)   
	(20.000      1.4117    0.1151)   
	(22.000      1.4284    0.1382)   
	(25.000      1.4397    0.1756)   
	(26.000      1.4383    0.1885)   
	(30.000      1.3044    0.2601)   
	(40.000      1.0665    0.4626)   
	(50.000      0.8700    0.6794)   
	(60.000      0.6674    0.8854)   
	(70.000      0.4482    1.0567)   
	(80.000      0.2198    1.1738)   
	(90.000      0.0000    1.2239)   
	(100.000    -0.1539    1.1738) 
	(110.000    -0.3137    1.0567) 
	(120.000    -0.4672    0.8854) 
	(130.000    -0.6090    0.6794) 
	(140.000    -0.7465    0.4626) 
	(150.000    -0.9131    0.2601) 
	(160.000    -0.7745    0.0957) 
	(170.000    -0.3872    0.0427) 
	(180.000     0.0000    0.0427)  
);





