tutorials/fastFlume/constant/airfoilProperties/NACA6_0329
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 32.9 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.9023  Zero Cn angle of attack (deg)
// 5.8919   Cn slope for zero lift (dimensionless)
// 2.8693   Cn extrapolated to value at positive stall angle of attack
// -0.6107  Cn at stall value for negative angle of attack
// 0.0000   Angle of attack for minimum CD (deg)
// 0.0872   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.0908) 
	(-170.000    0.3589    0.0908) 
	(-160.000    0.7178    0.1399) 
	(-150.000    0.8463    0.2923) 
	(-140.000    0.6918    0.4800) 
	(-130.000    0.5644    0.6809) 
	(-120.000    0.4330    0.8718) 
	(-110.000    0.2907    1.0306) 
	(-100.000    0.1426    1.1392) 
	(-90.000     0.0000    1.1856)  
	(-80.000    -0.1426    1.1392) 
	(-70.000    -0.2907    1.0306) 
	(-60.000    -0.4330    0.8718) 
	(-50.000    -0.5644    0.6809) 
	(-40.000    -0.6918    0.4800) 
	(-30.000    -0.8463    0.2923) 
	(-20.000    -0.7416    0.1764) 
	(-10.000    -0.6035    0.0940) 
	(-9.000     -0.5784    0.0917)  
	(-8.000     -0.5289    0.0908)  
	(-5.000     -0.2459    0.0889)  
	(-4.000     -0.1417    0.0885)  
	(-3.000     -0.0350    0.0882)  
	(-2.000      0.0720    0.0876)   
	(-1.000      0.1806    0.0873)   
	(0.000       0.2903    0.0872)    
	(1.000       0.3977    0.0872)    
	(2.000       0.5029    0.0874)    
	(3.000       0.6065    0.0878)    
	(4.000       0.7026    0.0885)    
	(6.000       0.8709    0.0903)    
	(7.000       0.9390    0.0909)    
	(8.000       0.9903    0.0919)    
	(9.000       1.0182    0.0941)    
	(11.000      1.0718    0.1008)   
	(12.000      1.1056    0.1046)   
	(13.000      1.1409    0.1088)   
	(15.000      1.2029    0.1193)   
	(16.000      1.2292    0.1256)   
	(17.000      1.2559    0.1323)   
	(18.000      1.2741    0.1402)   
	(19.000      1.2946    0.1485)   
	(20.000      1.3084    0.1579)   
	(22.000      1.3238    0.1794)   
	(25.000      1.3343    0.2140)   
	(26.000      1.3330    0.2260)   
	(30.000      1.2089    0.2923)   
	(40.000      0.9884    0.4800)   
	(50.000      0.8063    0.6809)   
	(60.000      0.6186    0.8718)   
	(70.000      0.4154    1.0306)   
	(80.000      0.2037    1.1392)   
	(90.000      0.0000    1.1856)   
	(100.000    -0.1426    1.1392) 
	(110.000    -0.2907    1.0306) 
	(120.000    -0.4330    0.8718) 
	(130.000    -0.5644    0.6809) 
	(140.000    -0.6918    0.4800) 
	(150.000    -0.8463    0.2923) 
	(160.000    -0.7178    0.1399) 
	(170.000    -0.3589    0.0908) 
	(180.000     0.0000    0.0908)  
);



