tutorials/fastFlume/constant/airfoilProperties/NACA6_0444
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 44.4 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.8339  Zero Cn angle of attack (deg)
// 5.0009   Cn slope for zero lift (dimensionless)
// 2.4294   Cn extrapolated to value at positive stall angle of attack
// -0.5268  Cn at stall value for negative angle of attack
// 0.0000   Angle of attack for minimum CD (deg)
// 0.1922   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.1952) 
	(-170.000    0.2974    0.1952) 
	(-160.000    0.5948    0.2359) 
	(-150.000    0.7012    0.3622) 
	(-140.000    0.5733    0.5177) 
	(-130.000    0.4677    0.6842) 
	(-120.000    0.3588    0.8424) 
	(-110.000    0.2409    0.9739) 
	(-100.000    0.1181    1.0639) 
	(-90.000     0.0000    1.1024)  
	(-80.000    -0.1181    1.0639) 
	(-70.000    -0.2409    0.9739) 
	(-60.000    -0.3588    0.8424) 
	(-50.000    -0.4677    0.6842) 
	(-40.000    -0.5733    0.5177) 
	(-30.000    -0.7012    0.3622) 
	(-20.000    -0.6145    0.2662) 
	(-10.000    -0.5000    0.1978) 
	(-9.000     -0.4793    0.1959)  
	(-8.000     -0.4382    0.1952)  
	(-5.000     -0.2037    0.1937)  
	(-4.000     -0.1174    0.1933)  
	(-3.000     -0.0290    0.1930)  
	(-2.000      0.0596    0.1926)   
	(-1.000      0.1497    0.1923)   
	(0.000       0.2405    0.1922)    
	(1.000       0.3296    0.1922)    
	(2.000       0.4167    0.1924)    
	(3.000       0.5025    0.1927)    
	(4.000       0.5822    0.1933)    
	(6.000       0.7216    0.1948)    
	(7.000       0.7781    0.1953)    
	(8.000       0.8206    0.1961)    
	(9.000       0.8437    0.1979)    
	(11.000      0.8881    0.2035)   
	(12.000      0.9161    0.2066)   
	(13.000      0.9453    0.2101)   
	(15.000      0.9967    0.2188)   
	(16.000      1.0185    0.2240)   
	(17.000      1.0407    0.2296)   
	(18.000      1.0557    0.2362)   
	(19.000      1.0727    0.2430)   
	(20.000      1.0841    0.2508)   
	(22.000      1.0969    0.2686)   
	(25.000      1.1056    0.2973)   
	(26.000      1.1045    0.3072)   
	(30.000      1.0018    0.3622)   
	(40.000      0.8190    0.5177)   
	(50.000      0.6682    0.6842)   
	(60.000      0.5125    0.8424)   
	(70.000      0.3442    0.9739)   
	(80.000      0.1688    1.0639)   
	(90.000      0.0000    1.1024)   
	(100.000    -0.1181    1.0639) 
	(110.000    -0.2409    0.9739) 
	(120.000    -0.3588    0.8424) 
	(130.000    -0.4677    0.6842) 
	(140.000    -0.5733    0.5177) 
	(150.000    -0.7012    0.3622) 
	(160.000    -0.5948    0.2359) 
	(170.000    -0.2974    0.1952) 
	(180.000     0.0000    0.1952)  
);



