tutorials/fastFlume/constant/airfoilProperties/NACA6_0629
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 62.9 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -2.6487  Zero Cn angle of attack (deg)
// 3.5701   Cn slope for zero lift (dimensionless)
// 1.7228   Cn extrapolated to value at positive stall angle of attack
// -0.3920  Cn at stall value for negative angle of attack
// -1.0000  Angle of attack for minimum CD (deg)
// 0.3612   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.3632) 
	(-170.000    0.1984    0.3632) 
	(-160.000    0.3969    0.3903) 
	(-150.000    0.4679    0.4746) 
	(-140.000    0.3825    0.5784) 
	(-130.000    0.3121    0.6895) 
	(-120.000    0.2394    0.7950) 
	(-110.000    0.1608    0.8828) 
	(-100.000    0.0788    0.9428) 
	(-90.000     0.0000    0.9685)  
	(-80.000    -0.0788    0.9428) 
	(-70.000    -0.1608    0.8828) 
	(-60.000    -0.2394    0.7950) 
	(-50.000    -0.3121    0.6895) 
	(-40.000    -0.3825    0.5784) 
	(-30.000    -0.4679    0.4746) 
	(-20.000    -0.4101    0.4105) 
	(-10.000    -0.3337    0.3649) 
	(-9.000     -0.3198    0.3637)  
	(-8.000     -0.2924    0.3632)  
	(-5.000     -0.1360    0.3621)  
	(-4.000     -0.0783    0.3619)  
	(-3.000     -0.0193    0.3617)  
	(-2.000      0.0398    0.3614)   
	(-1.000      0.0999    0.3612)   
	(0.000       0.1605    0.3612)    
	(1.000       0.2199    0.3612)    
	(2.000       0.2781    0.3613)    
	(3.000       0.3353    0.3615)    
	(4.000       0.3885    0.3619)    
	(6.000       0.4815    0.3629)    
	(7.000       0.5192    0.3632)    
	(8.000       0.5476    0.3638)    
	(9.000       0.5629    0.3650)    
	(11.000      0.5926    0.3687)   
	(12.000      0.6113    0.3708)   
	(13.000      0.6308    0.3731)   
	(15.000      0.6651    0.3789)   
	(16.000      0.6796    0.3824)   
	(17.000      0.6944    0.3861)   
	(18.000      0.7045    0.3905)   
	(19.000      0.7158    0.3950)   
	(20.000      0.7234    0.4003)   
	(22.000      0.7319    0.4121)   
	(25.000      0.7378    0.4313)   
	(26.000      0.7370    0.4379)   
	(30.000      0.6684    0.4746)   
	(40.000      0.5465    0.5784)   
	(50.000      0.4458    0.6895)   
	(60.000      0.3420    0.7950)   
	(70.000      0.2297    0.8828)   
	(80.000      0.1126    0.9428)   
	(90.000      0.0000    0.9685)   
	(100.000    -0.0788    0.9428) 
	(110.000    -0.1608    0.8828) 
	(120.000    -0.2394    0.7950) 
	(130.000    -0.3121    0.6895) 
	(140.000    -0.3825    0.5784) 
	(150.000    -0.4679    0.4746) 
	(160.000    -0.3969    0.3903) 
	(170.000    -0.1984    0.3632) 
	(180.000     0.0000    0.3632)  
);



