tutorials/fastFlume/constant/airfoilProperties/NACA6_0864
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file.  Compatible with AeroDyn v13.0.
// This file was generated automatically by HARP_Opt.
// This data represents a 86.4 percent thick airfoil, and was interpolated between the airfoil data in the files NACA6_1000.dat and NACA6_0240.dat.
//   1           Number of airfoil tables in this file
//  8.000         Table ID parameter Reynolds number in millions
// 0      Control Setting (integer)
// 25.0000  Stall angle (deg)
// -1.9782  Zero Cn angle of attack (deg)
// 1.7518   Cn slope for zero lift (dimensionless)
// 0.8249   Cn extrapolated to value at positive stall angle of attack
// -0.2207  Cn at stall value for negative angle of attack
// -1.0000  Angle of attack for minimum CD (deg)
// 0.5758   Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
	(-180.000    0.0000    0.5765) 
	(-170.000    0.0727    0.5765) 
	(-160.000    0.1455    0.5865) 
	(-150.000    0.1715    0.6174) 
	(-140.000    0.1402    0.6554) 
	(-130.000    0.1144    0.6961) 
	(-120.000    0.0878    0.7348) 
	(-110.000    0.0589    0.7670) 
	(-100.000    0.0289    0.7890) 
	(-90.000     0.0000    0.7984)  
	(-80.000    -0.0289    0.7890) 
	(-70.000    -0.0589    0.7670) 
	(-60.000    -0.0878    0.7348) 
	(-50.000    -0.1144    0.6961) 
	(-40.000    -0.1402    0.6554) 
	(-30.000    -0.1715    0.6174) 
	(-20.000    -0.1503    0.5939) 
	(-10.000    -0.1223    0.5772) 
	(-9.000     -0.1172    0.5767)  
	(-8.000     -0.1072    0.5765)  
	(-5.000     -0.0498    0.5762)  
	(-4.000     -0.0287    0.5761)  
	(-3.000     -0.0071    0.5760)  
	(-2.000      0.0146    0.5759)   
	(-1.000      0.0366    0.5758)   
	(0.000       0.0588    0.5758)    
	(1.000       0.0806    0.5758)    
	(2.000       0.1019    0.5758)    
	(3.000       0.1229    0.5759)    
	(4.000       0.1424    0.5761)    
	(6.000       0.1765    0.5764)    
	(7.000       0.1903    0.5765)    
	(8.000       0.2007    0.5767)    
	(9.000       0.2064    0.5772)    
	(11.000      0.2172    0.5785)   
	(12.000      0.2241    0.5793)   
	(13.000      0.2312    0.5802)   
	(15.000      0.2438    0.5823)   
	(16.000      0.2491    0.5836)   
	(17.000      0.2546    0.5849)   
	(18.000      0.2582    0.5865)   
	(19.000      0.2624    0.5882)   
	(20.000      0.2652    0.5901)   
	(22.000      0.2683    0.5945)   
	(25.000      0.2704    0.6015)   
	(26.000      0.2702    0.6039)   
	(30.000      0.2450    0.6174)   
	(40.000      0.2003    0.6554)   
	(50.000      0.1634    0.6961)   
	(60.000      0.1254    0.7348)   
	(70.000      0.0842    0.7670)   
	(80.000      0.0413    0.7890)   
	(90.000      0.0000    0.7984)   
	(100.000    -0.0289    0.7890) 
	(110.000    -0.0589    0.7670) 
	(120.000    -0.0878    0.7348) 
	(130.000    -0.1144    0.6961) 
	(140.000    -0.1402    0.6554) 
	(150.000    -0.1715    0.6174) 
	(160.000    -0.1455    0.5865) 
	(170.000    -0.0727    0.5765) 
	(180.000     0.0000    0.5765)  
);



