tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p042
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.042          Table ID parameter
// 0.0         Control setting
// 48.00          Stall angle (deg)
// -2.90          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.73610        Cn slope for zero lift for linear Cn curve (1/rad)
// -0.3778        Cn at stall value for positive angle of attack for linear Cn curve
// -0.3261        Cn at stall value for negative angle of attack for linear Cn curve
// 0.00           Angle of attack for minimum CD (deg)
// 0.0267         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.0852    0.0060)
   (-150.00    0.5452    0.4213)
   (-120.00    0.3853    1.2358)
   ( -90.00   -0.0691    1.6376)
   ( -60.00   -0.4515    1.2344)
   ( -30.00   -0.5157    0.4159)
   ( -10.00   -0.3652    0.1045)
   (  -9.50   -0.3962    0.0967)
   (  -9.00   -0.4483    0.0876)
   (  -8.50   -0.5213    0.0767)
   (  -8.00   -0.5306    0.0669)
   (  -7.50   -0.5220    0.0538)
   (  -7.00   -0.4763    0.0486)
   (  -6.50   -0.4256    0.0439)
   (  -6.00   -0.3731    0.0405)
   (  -5.50   -0.3158    0.0378)
   (  -5.00   -0.2553    0.0357)
   (  -4.50   -0.1931    0.0342)
   (  -4.00   -0.1288    0.0328)
   (  -3.50   -0.0696    0.0317)
   (  -3.00   -0.0120    0.0308)
   (  -2.50    0.0468    0.0300)
   (  -2.00    0.1054    0.0292)
   (  -1.50    0.1626    0.0283)
   (  -1.00    0.2090    0.0277)
   (  -0.50    0.2545    0.0270)
   (   0.00    0.3486    0.0267)
   (   0.50    0.4005    0.0269)
   (   1.00    0.4538    0.0272)
   (   1.50    0.4978    0.0279)
   (   2.00    0.5456    0.0286)
   (   2.50    0.5942    0.0293)
   (   3.00    0.6427    0.0300)
   (   3.50    0.6905    0.0308)
   (   4.00    0.7372    0.0317)
   (   4.50    0.7828    0.0327)
   (   5.00    0.8271    0.0338)
   (   5.50    0.8701    0.0350)
   (   6.00    0.9093    0.0363)
   (   6.50    0.9350    0.0384)
   (   7.00    0.9605    0.0404)
   (   7.50    0.9874    0.0425)
   (   8.00    1.0156    0.0445)
   (   8.50    1.0459    0.0464)
   (   9.00    1.0501    0.0503)
   (   9.50    1.0596    0.0541)
   (  10.00    1.0875    0.0560)
   (  10.50    1.0712    0.0627)
   (  11.50    1.0889    0.0711)
   (  12.00    1.0836    0.0774)
   (  12.50    1.1126    0.0787)
   (  13.00    1.1022    0.0860)
   (  13.50    1.0997    0.0924)
   (  14.00    1.1244    0.0942)
   (  14.50    1.1105    0.1029)
   (  15.00    1.1185    0.1079)
   (  15.50    1.1118    0.1159)
   (  16.00    1.1267    0.1198)
   (  16.50    1.1040    0.1319)
   (  17.00    1.0879    0.1433)
   (  17.50    1.0765    0.1543)
   (  18.00    1.0658    0.1659)
   (  18.50    1.0564    0.1780)
   (  19.00    1.0500    0.1899)
   (  19.50    1.0493    0.2005)
   (  20.00    1.0570    0.2085)
   (  20.50    1.0624    0.2176)
   (  21.00    1.0654    0.2279)
   (  21.50    1.0807    0.2336)
   (  22.00    1.0834    0.2443)
   (  22.50    1.0988    0.2501)
   (  23.00    1.1044    0.2595)
   (  23.50    1.1168    0.2663)
   (  24.00    1.1290    0.2732)
   (  24.50    1.1391    0.2807)
   (  25.00    1.1517    0.2873)
   (  26.00    1.1758    0.2909)
   (  27.00    1.1979    0.3137)
   (  28.00    1.2192    0.3373)
   (  29.00    1.2396    0.3616)
   (  30.00    1.2591    0.3865)
   (  60.00    1.3446    1.2645)
   (  90.00    0.3568    1.7299)
   ( 120.00   -0.9402    1.3031)
   ( 150.00   -1.0110    0.4345)
   ( 180.00   -0.0852    0.0060)

); 

