tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p083
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.083          Table ID parameter
// 0.0         Control setting
// 12.00          Stall angle (deg)
// -3.70          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.46609        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1535         Cn at stall value for positive angle of attack for linear Cn curve
// -0.5375        Cn at stall value for negative angle of attack for linear Cn curve
// 0.50           Angle of attack for minimum CD (deg)
// 0.0169         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1090    0.0060)
   (-150.00    0.5119    0.4213)
   (-120.00    0.3470    1.2358)
   ( -90.00   -0.0596    1.6376)
   ( -60.00   -0.4052    1.2344)
   ( -30.00   -0.4845    0.4157)
   ( -10.00   -0.6386    0.0515)
   (  -9.50   -0.6125    0.0458)
   (  -9.00   -0.5829    0.0395)
   (  -8.50   -0.5381    0.0356)
   (  -8.00   -0.4862    0.0331)
   (  -7.50   -0.4321    0.0308)
   (  -7.00   -0.3761    0.0288)
   (  -6.50   -0.3197    0.0271)
   (  -6.00   -0.2629    0.0256)
   (  -5.50   -0.2060    0.0243)
   (  -5.00   -0.1491    0.0232)
   (  -4.50   -0.0922    0.0222)
   (  -4.00   -0.0349    0.0214)
   (  -3.50    0.0229    0.0206)
   (  -3.00    0.0767    0.0200)
   (  -2.50    0.1322    0.0195)
   (  -2.00    0.1892    0.0190)
   (  -1.50    0.2451    0.0185)
   (  -1.00    0.2991    0.0181)
   (  -0.50    0.3515    0.0175)
   (   0.00    0.3993    0.0170)
   (   0.50    0.4716    0.0169)
   (   1.00    0.5517    0.0171)
   (   1.50    0.6000    0.0174)
   (   2.00    0.6479    0.0177)
   (   2.50    0.6968    0.0182)
   (   3.00    0.7460    0.0186)
   (   3.50    0.7952    0.0191)
   (   4.00    0.8441    0.0197)
   (   4.50    0.8926    0.0203)
   (   5.00    0.9404    0.0209)
   (   5.50    0.9873    0.0215)
   (   6.00    1.0330    0.0223)
   (   6.50    1.0773    0.0230)
   (   7.00    1.1198    0.0238)
   (   7.50    1.1602    0.0246)
   (   8.00    1.1982    0.0255)
   (   8.50    1.2287    0.0265)
   (   9.00    1.2535    0.0277)
   (   9.50    1.2755    0.0290)
   (  10.50    1.3076    0.0327)
   (  11.00    1.3175    0.0353)
   (  11.50    1.3230    0.0386)
   (  12.00    1.3240    0.0426)
   (  12.50    1.3205    0.0474)
   (  13.00    1.3132    0.0530)
   (  13.50    1.3032    0.0594)
   (  14.00    1.2934    0.0663)
   (  14.50    1.2824    0.0736)
   (  15.00    1.2734    0.0811)
   (  15.50    1.2646    0.0887)
   (  16.00    1.2570    0.0964)
   (  16.50    1.2509    0.1040)
   (  17.00    1.2467    0.1114)
   (  17.50    1.2439    0.1188)
   (  18.00    1.2425    0.1261)
   (  18.50    1.2427    0.1332)
   (  19.00    1.2426    0.1405)
   (  19.50    1.2406    0.1484)
   (  20.00    1.2411    0.1559)
   (  20.50    1.2352    0.1651)
   (  21.00    1.2210    0.1766)
   (  21.50    1.2115    0.1873)
   (  22.00    1.1380    0.2195)
   (  22.50    1.1328    0.2323)
   (  23.00    1.1280    0.2463)
   (  23.50    1.1333    0.2562)
   (  24.00    1.1440    0.2634)
   (  24.50    1.1514    0.2727)
   (  25.00    1.1630    0.2796)
   (  26.00    1.1034    0.3055)
   (  27.00    1.1074    0.3315)
   (  28.00    1.1132    0.3579)
   (  29.00    1.1205    0.3849)
   (  30.00    1.1290    0.4123)
   (  60.00    1.1909    1.3068)
   (  90.00    0.2272    1.7535)
   ( 120.00   -0.9689    1.3115)
   ( 150.00   -1.0492    0.4359)
   ( 180.00   -0.1090    0.0060)

); 

