tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p100
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.100          Table ID parameter
// 0.0         Control setting
// 12.00          Stall angle (deg)
// -3.83          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.36612        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1680         Cn at stall value for positive angle of attack for linear Cn curve
// -0.6156        Cn at stall value for negative angle of attack for linear Cn curve
// 0.50           Angle of attack for minimum CD (deg)
// 0.0154         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1127    0.0060)
   (-150.00    0.5027    0.4213)
   (-120.00    0.3343    1.2358)
   ( -90.00   -0.0567    1.6376)
   ( -60.00   -0.3903    1.2344)
   ( -30.00   -0.4764    0.4156)
   ( -10.00   -0.6509    0.0419)
   (  -9.50   -0.6180    0.0366)
   (  -9.00   -0.5692    0.0340)
   (  -8.50   -0.5188    0.0312)
   (  -8.00   -0.4642    0.0289)
   (  -7.50   -0.4072    0.0270)
   (  -7.00   -0.3501    0.0254)
   (  -6.50   -0.2946    0.0240)
   (  -6.00   -0.2386    0.0228)
   (  -5.50   -0.1851    0.0218)
   (  -5.00   -0.1305    0.0208)
   (  -4.50   -0.0750    0.0200)
   (  -4.00   -0.0189    0.0193)
   (  -3.50    0.0380    0.0186)
   (  -3.00    0.0947    0.0180)
   (  -2.50    0.1490    0.0176)
   (  -2.00    0.2049    0.0172)
   (  -1.50    0.2599    0.0168)
   (  -1.00    0.3137    0.0165)
   (  -0.50    0.3670    0.0160)
   (   0.00    0.4153    0.0156)
   (   0.50    0.4685    0.0154)
   (   1.00    0.5544    0.0155)
   (   1.50    0.6136    0.0157)
   (   2.00    0.6612    0.0161)
   (   2.50    0.7097    0.0165)
   (   3.00    0.7587    0.0169)
   (   3.50    0.8078    0.0174)
   (   4.00    0.8567    0.0179)
   (   4.50    0.9053    0.0184)
   (   5.00    0.9533    0.0190)
   (   5.50    1.0005    0.0196)
   (   6.00    1.0467    0.0202)
   (   6.50    1.0915    0.0209)
   (   7.00    1.1344    0.0216)
   (   7.50    1.1752    0.0224)
   (   8.00    1.2132    0.0232)
   (   8.50    1.2451    0.0241)
   (   9.00    1.2715    0.0251)
   (   9.50    1.2944    0.0263)
   (  10.00    1.3142    0.0279)
   (  10.50    1.3302    0.0299)
   (  11.00    1.3419    0.0323)
   (  11.50    1.3491    0.0354)
   (  12.00    1.3518    0.0392)
   (  12.50    1.3501    0.0437)
   (  13.00    1.3447    0.0490)
   (  13.50    1.3368    0.0550)
   (  14.00    1.3284    0.0615)
   (  14.50    1.3184    0.0686)
   (  15.00    1.3076    0.0761)
   (  15.50    1.2984    0.0837)
   (  16.00    1.2898    0.0915)
   (  16.50    1.2818    0.0993)
   (  17.00    1.2761    0.1069)
   (  17.50    1.2723    0.1144)
   (  18.00    1.2695    0.1219)
   (  18.50    1.2678    0.1292)
   (  19.00    1.2673    0.1365)
   (  19.50    1.2669    0.1439)
   (  20.00    1.2678    0.1511)
   (  20.50    1.2659    0.1591)
   (  21.00    1.2635    0.1674)
   (  21.50    1.2584    0.1765)
   (  22.00    1.2426    0.1886)
   (  22.50    1.2205    0.2031)
   (  24.00    1.1505    0.2601)
   (  24.50    1.1564    0.2700)
   (  25.00    1.1677    0.2768)
   (  26.00    1.1297    0.3031)
   (  27.00    1.1326    0.3291)
   (  28.00    1.1374    0.3557)
   (  29.00    1.1438    0.3827)
   (  30.00    1.1515    0.4102)
   (  60.00    1.2069    1.3063)
   (  90.00    0.2310    1.7534)
   ( 120.00   -0.9798    1.3114)
   ( 150.00   -1.0598    0.4359)
   ( 180.00   -0.1127    0.0060) 

); 

