tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p120
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.120          Table ID parameter
// 0.0         Control setting
// 12.50          Stall angle (deg)
// -3.96          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.34366        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1777         Cn at stall value for positive angle of attack for linear Cn curve
// -0.5998        Cn at stall value for negative angle of attack for linear Cn curve
// 0.50           Angle of attack for minimum CD (deg)
// 0.0142         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1165    0.0060)
   (-150.00    0.4957    0.4213)
   (-120.00    0.3251    1.2358)
   ( -90.00   -0.0545    1.6376)
   ( -60.00   -0.3795    1.2344)
   ( -30.00   -0.4700    0.4155)
   ( -10.00   -0.6502    0.0351)
   (  -9.50   -0.6027    0.0321)
   (  -9.00   -0.5494    0.0294)
   (  -8.50   -0.4984    0.0275)
   (  -8.00   -0.4461    0.0258)
   (  -7.50   -0.3924    0.0243)
   (  -7.00   -0.3377    0.0229)
   (  -6.50   -0.2824    0.0217)
   (  -6.00   -0.2267    0.0206)
   (  -5.50   -0.1707    0.0197)
   (  -5.00   -0.1142    0.0188)
   (  -4.50   -0.0590    0.0181)
   (  -4.00   -0.0041    0.0175)
   (  -3.50    0.0516    0.0169)
   (  -3.00    0.1081    0.0165)
   (  -2.50    0.1624    0.0161)
   (  -2.00    0.2173    0.0157)
   (  -1.50    0.2715    0.0154)
   (  -1.00    0.3249    0.0152)
   (  -0.50    0.3773    0.0148)
   (   0.00    0.4269    0.0144)
   (   0.50    0.4750    0.0142)
   (   1.00    0.5441    0.0142)
   (   1.50    0.6234    0.0144)
   (   2.00    0.6705    0.0147)
   (   2.50    0.7186    0.0151)
   (   3.00    0.7673    0.0155)
   (   3.50    0.8162    0.0159)
   (   4.00    0.8651    0.0164)
   (   4.50    0.9138    0.0169)
   (   5.00    0.9620    0.0174)
   (   5.50    1.0095    0.0180)
   (   6.00    1.0560    0.0186)
   (   6.50    1.1010    0.0192)
   (   7.00    1.1443    0.0198)
   (   7.50    1.1852    0.0205)
   (   8.00    1.2230    0.0213)
   (   8.50    1.2553    0.0221)
   (   9.00    1.2823    0.0231)
   (   9.50    1.3065    0.0243)
   (  10.00    1.3274    0.0259)
   (  10.50    1.3443    0.0278)
   (  11.00    1.3570    0.0302)
   (  11.50    1.3658    0.0332)
   (  12.00    1.3704    0.0368)
   (  12.50    1.3710    0.0410)
   (  13.50    1.3642    0.0515)
   (  14.00    1.3571    0.0577)
   (  14.50    1.3506    0.0643)
   (  15.00    1.3428    0.0713)
   (  15.50    1.3343    0.0786)
   (  16.00    1.3260    0.0862)
   (  16.50    1.3179    0.0939)
   (  17.00    1.3101    0.1018)
   (  17.50    1.3038    0.1096)
   (  18.00    1.3000    0.1171)
   (  18.50    1.2963    0.1247)
   (  19.00    1.2936    0.1323)
   (  19.50    1.2928    0.1397)
   (  20.00    1.2925    0.1470)
   (  20.50    1.2914    0.1547)
   (  21.00    1.2913    0.1622)
   (  21.50    1.2886    0.1705)
   (  22.00    1.2870    0.1787)
   (  22.50    1.2753    0.1895)
   (  23.00    1.2726    0.1983)
   (  23.50    1.1903    0.2322)
   (  25.00    1.1717    0.2748)
   (  26.00    1.1682    0.2990)
   (  27.00    1.1695    0.3252)
   (  28.00    1.1728    0.3518)
   (  29.00    1.1777    0.3790)
   (  30.00    1.1840    0.4066)
   (  60.00    1.2217    1.3052)
   (  90.00    0.2352    1.7531)
   ( 120.00   -0.9870    1.3114)
   ( 150.00   -1.0680    0.4359)
   ( 180.00   -0.1165    0.0060)

); 

