tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p140
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.140          Table ID parameter
// 0.0         Control setting
// 12.50          Stall angle (deg)
// -4.06          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.30053        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1834         Cn at stall value for positive angle of attack for linear Cn curve
// -0.5893        Cn at stall value for negative angle of attack for linear Cn curve
// 1.00           Angle of attack for minimum CD (deg)
// 0.0133         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1194    0.0060)
   (-150.00    0.4913    0.4213)
   (-120.00    0.3195    1.2358)
   ( -90.00   -0.0532    1.6376)
   ( -60.00   -0.3728    1.2343)
   ( -30.00   -0.4660    0.4154)
   ( -10.00   -0.6405    0.0312)
   (  -9.50   -0.5927    0.0286)
   (  -9.00   -0.5415    0.0268)
   (  -8.50   -0.4887    0.0251)
   (  -8.00   -0.4337    0.0235)
   (  -7.50   -0.3778    0.0221)
   (  -7.00   -0.3237    0.0210)
   (  -6.50   -0.2701    0.0199)
   (  -6.00   -0.2158    0.0190)
   (  -5.50   -0.1610    0.0182)
   (  -5.00   -0.1055    0.0174)
   (  -4.50   -0.0494    0.0168)
   (  -4.00    0.0065    0.0162)
   (  -3.50    0.0609    0.0158)
   (  -3.00    0.1162    0.0153)
   (  -2.50    0.1708    0.0150)
   (  -2.00    0.2249    0.0147)
   (  -1.50    0.2788    0.0145)
   (  -1.00    0.3320    0.0143)
   (  -0.50    0.3844    0.0140)
   (   0.00    0.4342    0.0136)
   (   0.50    0.4824    0.0134)
   (   1.00    0.5363    0.0133)
   (   1.50    0.6165    0.0135)
   (   2.00    0.6761    0.0138)
   (   2.50    0.7238    0.0141)
   (   3.00    0.7723    0.0145)
   (   3.50    0.8212    0.0149)
   (   4.00    0.8701    0.0153)
   (   4.50    0.9189    0.0158)
   (   5.00    0.9672    0.0163)
   (   5.50    1.0148    0.0168)
   (   6.00    1.0615    0.0174)
   (   6.50    1.1067    0.0180)
   (   7.00    1.1501    0.0186)
   (   7.50    1.1910    0.0192)
   (   8.00    1.2285    0.0199)
   (   8.50    1.2605    0.0208)
   (   9.00    1.2882    0.0218)
   (   9.50    1.3130    0.0230)
   (  10.00    1.3346    0.0246)
   (  10.50    1.3525    0.0265)
   (  11.00    1.3662    0.0289)
   (  11.50    1.3756    0.0318)
   (  12.00    1.3813    0.0353)
   (  12.50    1.3839    0.0394)
   (  13.00    1.3838    0.0440)
   (  13.50    1.3807    0.0494)
   (  14.00    1.3779    0.0551)
   (  14.50    1.3731    0.0613)
   (  15.00    1.3669    0.0681)
   (  15.50    1.3601    0.0751)
   (  16.00    1.3530    0.0824)
   (  16.50    1.3454    0.0900)
   (  17.00    1.3373    0.0978)
   (  17.50    1.3306    0.1056)
   (  18.00    1.3257    0.1132)
   (  18.50    1.3200    0.1211)
   (  19.00    1.3169    0.1287)
   (  19.50    1.3146    0.1362)
   (  20.00    1.3125    0.1439)
   (  20.50    1.3117    0.1513)
   (  21.00    1.3109    0.1589)
   (  21.50    1.3093    0.1669)
   (  22.00    1.3087    0.1746)
   (  22.50    1.3046    0.1834)
   (  23.00    1.2987    0.1927)
   (  23.50    1.2921    0.2024)
   (  24.00    1.2496    0.2230)
   (  25.00    1.1951    0.2704)
   (  26.00    1.1931    0.2960)
   (  27.00    1.1934    0.3222)
   (  28.00    1.1957    0.3489)
   (  29.00    1.1996    0.3762)
   (  30.00    1.2050    0.4039)
   (  60.00    1.2308    1.3045)
   (  90.00    0.2378    1.7529)
   ( 120.00   -0.9912    1.3113)
   ( 150.00   -1.0732    0.4359)
   ( 180.00   -0.1194    0.0060)

);