tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p160
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.160          Table ID parameter
// 0.0         Control setting
// 13.00          Stall angle (deg)
// -4.11          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.27188        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1471         Cn at stall value for positive angle of attack for linear Cn curve
// -0.6291        Cn at stall value for negative angle of attack for linear Cn curve
// 1.00           Angle of attack for minimum CD (deg)
// 0.0126         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1209    0.0060)
   (-150.00    0.4882    0.4213)
   (-120.00    0.3153    1.2358)
   ( -90.00   -0.0522    1.6376)
   ( -60.00   -0.3679    1.2343)
   ( -30.00   -0.4634    0.4152)
   ( -10.00   -0.6338    0.0283)
   (  -9.50   -0.5811    0.0264)
   (  -9.00   -0.5313    0.0247)
   (  -8.50   -0.4797    0.0231)
   (  -8.00   -0.4267    0.0219)
   (  -7.50   -0.3727    0.0207)
   (  -7.00   -0.3183    0.0196)
   (  -6.50   -0.2633    0.0186)
   (  -6.00   -0.2079    0.0178)
   (  -5.50   -0.1523    0.0170)
   (  -5.00   -0.0976    0.0163)
   (  -4.50   -0.0432    0.0158)
   (  -4.00    0.0121    0.0153)
   (  -3.50    0.0671    0.0148)
   (  -3.00    0.1213    0.0145)
   (  -2.50    0.1760    0.0142)
   (  -2.00    0.2297    0.0140)
   (  -1.50    0.2835    0.0138)
   (  -1.00    0.3365    0.0136)
   (  -0.50    0.3890    0.0134)
   (   0.00    0.4394    0.0131)
   (   0.50    0.4876    0.0128)
   (   1.00    0.5360    0.0126)
   (   1.50    0.6077    0.0128)
   (   2.00    0.6796    0.0131)
   (   2.50    0.7271    0.0134)
   (   3.00    0.7754    0.0138)
   (   3.50    0.8242    0.0141)
   (   4.00    0.8731    0.0146)
   (   4.50    0.9219    0.0150)
   (   5.00    0.9703    0.0154)
   (   5.50    1.0180    0.0159)
   (   6.00    1.0647    0.0165)
   (   6.50    1.1101    0.0170)
   (   7.00    1.1536    0.0176)
   (   7.50    1.1946    0.0182)
   (   8.00    1.2322    0.0189)
   (   8.50    1.2633    0.0197)
   (   9.00    1.2914    0.0208)
   (   9.50    1.3168    0.0221)
   (  10.00    1.3389    0.0236)
   (  10.50    1.3571    0.0256)
   (  11.00    1.3711    0.0280)
   (  11.50    1.3811    0.0309)
   (  12.00    1.3879    0.0344)
   (  12.50    1.3921    0.0383)
   (  13.00    1.3942    0.0428)
   (  13.50    1.3931    0.0479)
   (  14.00    1.3922    0.0534)
   (  14.50    1.3891    0.0594)
   (  15.00    1.3846    0.0658)
   (  15.50    1.3793    0.0726)
   (  16.00    1.3731    0.0797)
   (  16.50    1.3659    0.0872)
   (  17.00    1.3580    0.0949)
   (  17.50    1.3527    0.1024)
   (  18.00    1.3461    0.1102)
   (  18.50    1.3401    0.1181)
   (  19.00    1.3366    0.1257)
   (  19.50    1.3316    0.1336)
   (  20.00    1.3305    0.1411)
   (  20.50    1.3277    0.1488)
   (  21.00    1.3270    0.1564)
   (  21.50    1.3260    0.1640)
   (  22.00    1.3243    0.1720)
   (  22.50    1.3233    0.1799)
   (  23.00    1.3195    0.1885)
   (  23.50    1.3139    0.1978)
   (  24.00    1.3115    0.2064)
   (  24.50    1.2775    0.2242)
   (  25.00    1.2700    0.2351)
   (  26.00    1.2139    0.2933)
   (  27.00    1.2134    0.3195)
   (  28.00    1.2148    0.3463)
   (  29.00    1.2180    0.3736)
   (  30.00    1.2226    0.4014)
   (  60.00    1.2383    1.3037)
   (  90.00    0.2400    1.7526)
   ( 120.00   -0.9946    1.3112)
   ( 150.00   -1.0769    0.4358)
   ( 180.00   -0.1209    0.0060)

); 

