tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p180
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.180          Table ID parameter
// 0.0         Control setting
// 14.00          Stall angle (deg)
// -4.15          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.22927        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1498         Cn at stall value for positive angle of attack for linear Cn curve
// -0.6240        Cn at stall value for negative angle of attack for linear Cn curve
// 1.00           Angle of attack for minimum CD (deg)
// 0.0122         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1219    0.0060)
   (-150.00    0.4861    0.4213)
   (-120.00    0.3124    1.2358)
   ( -90.00   -0.0515    1.6376)
   ( -60.00   -0.3645    1.2343)
   ( -30.00   -0.4614    0.4152)
   ( -10.00   -0.6290    0.0265)
   (  -9.50   -0.5781    0.0246)
   (  -9.00   -0.5235    0.0230)
   (  -8.50   -0.4711    0.0217)
   (  -8.00   -0.4188    0.0205)
   (  -7.50   -0.3651    0.0194)
   (  -7.00   -0.3105    0.0184)
   (  -6.50   -0.2568    0.0175)
   (  -6.00   -0.2029    0.0168)
   (  -5.50   -0.1485    0.0161)
   (  -5.00   -0.0935    0.0155)
   (  -4.50   -0.0383    0.0150)
   (  -4.00    0.0159    0.0145)
   (  -3.50    0.0705    0.0142)
   (  -3.00    0.1249    0.0139)
   (  -2.50    0.1790    0.0136)
   (  -2.00    0.2327    0.0134)
   (  -1.50    0.2862    0.0132)
   (  -1.00    0.3393    0.0131)
   (  -0.50    0.3919    0.0129)
   (   0.00    0.4431    0.0127)
   (   0.50    0.4919    0.0124)
   (   1.00    0.5391    0.0122)
   (   1.50    0.5995    0.0122)
   (   2.00    0.6778    0.0125)
   (   2.50    0.7292    0.0128)
   (   3.00    0.7775    0.0131)
   (   3.50    0.8263    0.0135)
   (   4.00    0.8753    0.0139)
   (   4.50    0.9241    0.0143)
   (   5.00    0.9726    0.0148)
   (   5.50    1.0204    0.0152)
   (   6.00    1.0672    0.0157)
   (   6.50    1.1127    0.0163)
   (   7.00    1.1563    0.0168)
   (   7.50    1.1971    0.0174)
   (   8.00    1.2340    0.0181)
   (   8.50    1.2646    0.0190)
   (   9.00    1.2932    0.0200)
   (   9.50    1.3189    0.0213)
   (  10.00    1.3415    0.0229)
   (  10.50    1.3601    0.0249)
   (  11.00    1.3745    0.0273)
   (  11.50    1.3852    0.0302)
   (  12.00    1.3931    0.0336)
   (  12.50    1.3987    0.0375)
   (  13.00    1.4022    0.0418)
   (  13.50    1.4027    0.0468)
   (  14.00    1.4029    0.0521)
   (  14.50    1.4015    0.0579)
   (  15.00    1.3984    0.0642)
   (  15.50    1.3941    0.0708)
   (  16.00    1.3882    0.0778)
   (  16.50    1.3816    0.0852)
   (  17.00    1.3762    0.0925)
   (  17.50    1.3695    0.1001)
   (  18.00    1.3622    0.1080)
   (  18.50    1.3578    0.1156)
   (  19.00    1.3512    0.1236)
   (  19.50    1.3485    0.1311)
   (  20.00    1.3443    0.1390)
   (  20.50    1.3428    0.1465)
   (  21.00    1.3400    0.1544)
   (  21.50    1.3393    0.1619)
   (  22.00    1.3377    0.1698)
   (  22.50    1.3363    0.1777)
   (  23.00    1.3343    0.1858)
   (  23.50    1.3323    0.1940)
   (  24.00    1.3250    0.2037)
   (  24.50    1.3223    0.2124)
   (  25.00    1.2990    0.2271)
   (  26.00    1.2683    0.2863)
   (  27.00    1.2663    0.3125)
   (  28.00    1.2661    0.3392)
   (  29.00    1.2675    0.3666)
   (  30.00    1.2702    0.3945)
   (  60.00    1.2533    1.3011)
   (  90.00    0.2456    1.7518)
   ( 120.00   -0.9969    1.3110)
   ( 150.00   -1.0794    0.4358)
   ( 180.00   -0.1219    0.0060)

); 

