tutorials/fastFlume/constant/airfoilProperties/NACA_4415_Re0p330
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// AeroDyn airfoil file Created with QBlade v0.963 64bit on 01.11.2016
// NACA 4415 airfoil, data comes from XFOIL with globally refined mesh, Ncrit = 4 for "dirty flume", Reynolds = [0.042 0.083 0.1 0.12 0.14 0.16 0.18 0.330]

// 0.330          Table ID parameter
// 0.0         Control setting
// 15.50          Stall angle (deg)
// -4.20          Angle of attack for zero Cn for linear Cn curve (deg)
// 6.18091        Cn slope for zero lift for linear Cn curve (1/rad)
// 1.1182         Cn at stall value for positive angle of attack for linear Cn curve
// -0.6070        Cn at stall value for negative angle of attack for linear Cn curve
// 2.00           Angle of attack for minimum CD (deg)
// 0.0103         Minimum CD value

airfoilData
(
//   alpha   C_l    C_d
   (-180.00   -0.1235    0.0060)
   (-150.00    0.4817    0.4213)
   (-120.00    0.3056    1.2358)
   ( -90.00   -0.0499    1.6376)
   ( -60.00   -0.3563    1.2343)
   ( -30.00   -0.4573    0.4151)
   ( -10.00   -0.6130    0.0193)
   (  -9.50   -0.5623    0.0182)
   (  -9.00   -0.5115    0.0172)
   (  -8.50   -0.4596    0.0163)
   (  -8.00   -0.4080    0.0156)
   (  -7.50   -0.3554    0.0149)
   (  -7.00   -0.3021    0.0142)
   (  -6.00   -0.1947    0.0132)
   (  -5.50   -0.1406    0.0128)
   (  -5.00   -0.0865    0.0124)
   (  -4.50   -0.0323    0.0121)
   (  -4.00    0.0218    0.0118)
   (  -3.50    0.0759    0.0116)
   (  -3.00    0.1298    0.0114)
   (  -2.50    0.1837    0.0113)
   (  -2.00    0.2375    0.0112)
   (  -1.50    0.2912    0.0111)
   (  -1.00    0.3447    0.0111)
   (  -0.50    0.3984    0.0110)
   (   0.00    0.4518    0.0110)
   (   0.50    0.5047    0.0109)
   (   1.00    0.5559    0.0106)
   (   1.50    0.6061    0.0104)
   (   2.00    0.6533    0.0103)
   (   2.50    0.7136    0.0104)
   (   3.00    0.7855    0.0107)
   (   3.50    0.8344    0.0110)
   (   4.00    0.8835    0.0113)
   (   4.50    0.9330    0.0116)
   (   5.00    0.9823    0.0120)
   (   5.50    1.0308    0.0124)
   (   6.00    1.0782    0.0128)
   (   6.50    1.1239    0.0132)
   (   7.00    1.1675    0.0138)
   (   7.50    1.2061    0.0144)
   (   8.00    1.2409    0.0152)
   (   8.50    1.2739    0.0162)
   (   9.00    1.3040    0.0174)
   (   9.50    1.3313    0.0188)
   (  10.00    1.3557    0.0205)
   (  10.50    1.3764    0.0224)
   (  11.00    1.3948    0.0247)
   (  11.50    1.4108    0.0273)
   (  12.00    1.4247    0.0303)
   (  12.50    1.4371    0.0336)
   (  13.00    1.4465    0.0373)
   (  13.50    1.4540    0.0415)
   (  14.00    1.4601    0.0461)
   (  14.50    1.4637    0.0512)
   (  15.00    1.4648    0.0568)
   (  15.50    1.4652    0.0627)
   (  16.00    1.4635    0.0690)
   (  16.50    1.4593    0.0758)
   (  17.00    1.4544    0.0828)
   (  17.50    1.4488    0.0900)
   (  18.00    1.4413    0.0977)
   (  18.50    1.4352    0.1053)
   (  19.00    1.4277    0.1131)
   (  19.50    1.4217    0.1209)
   (  20.00    1.4160    0.1288)
   (  20.50    1.4098    0.1368)
   (  21.00    1.4065    0.1445)
   (  21.50    1.4014    0.1526)
   (  22.00    1.3985    0.1603)
   (  22.50    1.3960    0.1681)
   (  23.00    1.3920    0.1763)
   (  23.50    1.3908    0.1840)
   (  24.00    1.3887    0.1919)
   (  24.50    1.3859    0.2001)
   (  25.00    1.3843    0.2081)
   (  26.00    1.3551    0.2747)
   (  27.00    1.3500    0.3009)
   (  28.00    1.3466    0.3278)
   (  29.00    1.3447    0.3553)
   (  30.00    1.3442    0.3834)
   (  60.00    1.2779    1.2972)
   (  90.00    0.2540    1.7506)
   ( 120.00   -1.0030    1.3107)
   ( 150.00   -1.0851    0.4358)
   ( 180.00   -0.1235    0.0060)

); 

