tutorials/fastFlume/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Molecular viscosity

transportModel Newtonian;
// Molecular viscosity
nu              nu [0 2 -1 0 0 0 0] 0.0;
// nu              nu [0 2 -1 0 0 0 0] 1.464e-5;	// air?
// nu              nu [0 2 -1 0 0 0 0] 1.0e-6; 		// water?

// LES SGS model (options are "standardSmagorinsky")
LESModel "standardSmagorinsky";

// Smagorinsky Constant
// Cs 0.125
// Cs 0.135;
Cs 0.168;
// Cs 0.17

// LES filter width scalar
deltaLESCoeff 1.0;

// ************************************************************************* //
