tutorials/fastFlume/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.05;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     2;
    }


    pFinal
    {
        solver          GAMG;
        tolerance       1e-12;
        relTol          0;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     2;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        maxIter         10000;
    }

    // T
    // {
    //     solver          PBiCG;
    //     preconditioner  DILU;
    //     tolerance       1e-15;
    //     relTol          0;
    //    maxIter         10000;
    // }

}

PISO
{
    nCorrectors              3;
    nNonOrthogonalCorrectors 0;

    pdRefOn                  true;
    pRefCell                 42;  // can use any cell to "tack" down pressure level
    pRefValue                0;

    // tempEqnOn                true; 
    tempEqnOn                false; 
}


// ************************************************************************* //






